import 'package:flutter/material.dart';
import 'package:flutter/src/widgets/container.dart';
import 'package:flutter/src/widgets/framework.dart';

class sadaqahjarih extends StatelessWidget {
  const sadaqahjarih({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        centerTitle: true,
        title: Text(
          'الدعاء لهم بالرحمه والمغفره',
          style: TextStyle(
            color: Colors.white,
            fontWeight: FontWeight.bold,
          ),
        ),
        backgroundColor: Colors.black,
      ),
      body: ListView.builder(
        itemCount: data.length,
        itemBuilder: (context, index) {
          return Center(
              child: ListTile(
            title: Text(
              data[index].toString(),
              style: TextStyle(
                fontWeight: FontWeight.bold,
              ),
            ),
          ));
        },
      ),
    );
  }
}

List data = [
  '''اللَّهمَّ إنَّ فلانَ بنَ فلانٍ في ذِمَّتِك وحبلِ جِوارِك فَقِهِ من فتنةِ القبرِ وعذابِ النَّارِ وأنتَ أهلُ الوفاءِ والحقِّ فاغفر لَه وارحمهُ إنَّكَ أنتَ الغفورُ الرَّحيمُ''',
 '___________________________________________________'
  'جدى الحاج نصر احمد الجاريه',
  'الحاج عيد فرج النشار',
  'زوج خالتى الحاج الدسوقى طه الشامى',
  'زوجه عمى الحاجه فوزيه الغنام',
  'محمد مسعد عبدالهادى',
  'شروق محمد سيد احمد',
  'الاستاذ رافت القلشى',
  'محمد مرعى',
  'الحاج ابراهيم محمد خليل',
  'الحاج محمد حامد ابو احمد',
  'الشيخ عبدالمنعم الاقرع',
  'نعيمه موسى محمود',
  'عطيات على السيد',
  'عبد المنعم على غريب ',
  'نزيهه ابو سلامه',
  'مرزوق عباس ',
  'على عبدالمنعم على غريب',
  'رمضان عبدالمنعم على غريب',
  'امتثال عبدالمنعم على غريب',
  'ابراهيم عبدالمنعم على غريب',
  'عبد المقصود شحبر',
  'موسى البشكار',
  'حور رجب',
  'اسراء جمال',
  'ساميه غنيم',
  'عاطف ايمن الغزالى',
  'ابراهيم مخمد اسماعيل',
  'مجدى على محمد شمس الدين',
  'عادل فضل الله',
  'الحاجه دريه رمضان جاب الله',
  'الحاج محمد رشاد محمد ',
  'الحاجه فوزيه الغدادى',
  'الحاج محمود غانم ',
  'على مصطفى شاهين',
  'محمد ابراهيم الرشيدى' ,
  'سعاد الرشيدى',
  'حسن الرشيدى',
  'احمد الرشيدى',
  'احمد محمد السطيحه',
  'صلوحه القطب عتلم',
  '___________________________________________________'
  '''اللهم أنت ربها، وأنت خلقتها، وأنت هديتها للإسلام، وأنت قبضت روحها، وأنت أعلم بسرها وعلانيتها، جئنا شفعاء فاغفر له''',
];
